#include <iostream>

int main()
{
    int forks[2][12] =
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1}
    };
    int spoons[2][12] =
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1}
    };
    int knives[2][12] =
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1}
    };
    int dessertSpoon[2][12] =
    {
        {1,0,0,0,0,0,0,0,0,0,0,0},
        {1,0,0,0,0,0,0,0,0,0,0,0}
    };
    int plates[2][12] =
    {
        {2,2,2,2,2,2,2,2,2,2,2,2},
        {2,2,2,2,2,2,2,2,2,2,2,2}
    };
    int chairs[2][12] =
    {
        {1,1,1,1,1,1,1,1,1,1,1,1},
        {1,1,1,1,1,1,1,1,1,1,1,1}
    };
    std::cout << "Let's start our banquet!" << std::endl;
    // Пришла дама с ребенком:
    chairs[0][4]++;
    // Сперли ложку:
    spoons[1][2]--;
    // ВИП поделился:
    spoons[1][2] = spoons[1][0]--;
    // Официант убрал тарелку:
    plates[1][0]--;
    
}